#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tucowsinc/gh-actions-demo-test3/runs/run-F9iX93SdEcPjsrct

Waiting for the plan to start...

Terraform v1.3.3
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # openstack_networking_secgroup_rule_v2.test_http will be created
  + resource "openstack_networking_secgroup_rule_v2" "test_http" {
      + description       = "http"
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 80
      + port_range_min    = 80
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_v2.test_secgroup will be created
  + resource "openstack_networking_secgroup_v2" "test_secgroup" {
      + all_tags    = (known after apply)
      + description = "test Access Rules"
      + id          = (known after apply)
      + name        = "test-sec-group"
      + region      = (known after apply)
      + tenant_id   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @rmokkapati-tc, Action: `pull_request`*